tutorials/compressible/rhoSimpleFoam/squareBend/system/isentropicTotalPressure
isentropicPressure
{
    type            pressure;
    libs            ("libfieldFunctionObjects.so");
    enabled         yes;
    writeControl    writeTime;
    mode            isentropic;
    result          isentropicP;
}
